{"format": "layers-model", "generatedBy": "keras v2.1.2", "convertedBy": "TensorFlow.js Converter v4.17.0", "modelTopology": {"keras_version": "2.1.2", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 28, 28, 1], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv0", 0, 0, {}]]], "name": "bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["bn0", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["bn1", 0, 0, {}]]], "name": "activation_2"}, {"class_name": "MaxPooling2D", "config": {"name": "MP1", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "MP1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["MP1", 0, 0, {}]]], "name": "conv2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2", 0, 0, {}]]], "name": "bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["bn2", 0, 0, {}]]], "name": "activation_3"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "conv3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv3", 0, 0, {}]]], "name": "bn3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["bn3", 0, 0, {}]]], "name": "activation_4"}, {"class_name": "MaxPooling2D", "config": {"name": "MP2", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "MP2"}, {"class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1"}, "inbound_nodes": [[["MP2", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fc1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "fc1"}, {"class_name": "Dropout", "config": {"rate": 0.4, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_2"}, "inbound_nodes": [[["fc1", 0, 0, {}]]], "name": "dropout_2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fco", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "fco"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["fco", 0, 0]], "name": "MNIST_Model"}}, "training_config": {"metrics": ["accuracy"], "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "decay": 0.0}}, "loss_weights": null, "sample_weight_mode": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bn0/gamma", "shape": [32], "dtype": "float32"}, {"name": "bn0/beta", "shape": [32], "dtype": "float32"}, {"name": "bn0/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "bn0/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "bn1/gamma", "shape": [32], "dtype": "float32"}, {"name": "bn1/beta", "shape": [32], "dtype": "float32"}, {"name": "bn1/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "bn1/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "bn2/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn2/beta", "shape": [64], "dtype": "float32"}, {"name": "bn2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn2/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "bn3/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn3/beta", "shape": [64], "dtype": "float32"}, {"name": "bn3/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn3/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv0/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "conv0/bias", "shape": [32], "dtype": "float32"}, {"name": "conv1/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2/bias", "shape": [64], "dtype": "float32"}, {"name": "conv3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "fc1/kernel", "shape": [1024, 256], "dtype": "float32"}, {"name": "fc1/bias", "shape": [256], "dtype": "float32"}, {"name": "fco/kernel", "shape": [256, 10], "dtype": "float32"}, {"name": "fco/bias", "shape": [10], "dtype": "float32"}]}]}